; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)          
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l6_p6_c6_g6_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate medicine crate2)
	(content-crate medicine crate3)
	(content-crate medicine crate4)
	(content-crate medicine crate5)
	(content-crate medicine crate6)
	(person-at person1 loc3)
	(person-at person2 loc1)
	(person-at person3 loc5)
	(person-at person4 loc5)
	(person-at person5 loc6)
	(person-at person6 loc5)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 medicine)
	(has-content-person person3 medicine)
	(has-content-person person4 food)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
))
)

; plan
1. (pick-up-crate crate6 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate6 depot)
   added: (has-crate-drone-arm drone1 right crate6)
   goals met: 1 of 7
2. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate1 depot)
   added: (has-crate-drone-arm drone1 left crate1)
   goals met: 1 of 7
3. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 0 of 7
4. (drop-crate loc5 person4 crate1 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate1)
   added: (has-content-person person4 food) (empty-arm drone1 left)
   goals met: 1 of 7
5. (drop-crate loc5 person3 crate6 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate6)
   added: (has-content-person person3 medicine) (empty-arm drone1 right)
   goals met: 2 of 7
6. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 3 of 7
7. (pick-up-crate crate5 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate5 depot)
   added: (has-crate-drone-arm drone1 right crate5)
   goals met: 3 of 7
8. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 2 of 7
9. (drop-crate loc6 person5 crate5 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate5)
   added: (has-content-person person5 medicine) (empty-arm drone1 right)
   goals met: 3 of 7
10. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 4 of 7
11. (pick-up-crate crate4 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate4 depot)
   added: (has-crate-drone-arm drone1 right crate4)
   goals met: 4 of 7
12. (drone-move depot loc3 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc3)
   goals met: 3 of 7
13. (drop-crate loc3 person1 crate4 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate4)
   added: (has-content-person person1 medicine) (empty-arm drone1 right)
   goals met: 4 of 7
14. (drone-move loc3 depot drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 depot)
   goals met: 5 of 7
15. (pick-up-crate crate3 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate3 depot)
   added: (has-crate-drone-arm drone1 right crate3)
   goals met: 5 of 7
16. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate2 depot)
   added: (has-crate-drone-arm drone1 left crate2)
   goals met: 5 of 7
17. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 4 of 7
18. (drop-crate loc5 person4 crate2 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate2)
   added: (has-content-person person4 medicine) (empty-arm drone1 left)
   goals met: 5 of 7
19. (drop-crate loc5 person6 crate3 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate3)
   added: (has-content-person person6 medicine) (empty-arm drone1 right)
   goals met: 6 of 7
20. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 7 of 7
